Revit 2017 API
TextNode.TextSize Property
 Height [ft] of the text in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017. Use FontHeight instead.")]
public double TextSize { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017. Use FontHeight instead.")> _
Public ReadOnly Property TextSize As Double
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017. Use FontHeight instead.")]
public:
property double TextSize {
	double get ();
}
Remarks
 The value specifies the height of the text excluding both the ascender and descender. It is approximately the height of capital letters in the font.
See Also
TextNode Class
Autodesk.Revit.DB Namespace